# sudo apt install git - установка системы контроля версий

# Git - система контроля версий - программа для управления версиями кода

# github - сервис для хранения кода

# репозиторий - папка с которой может взаимодействовать git

# git init - превращает текущую директорию в git репозиторий
# git status - проверка статуса репрозитория
# git add <file_name> / git add . - добавить файлы к отслеживанию изменений
# git commit -m "комментарий к версии" - сохранения версий кода / создание коммита
# git remote add <название_переменной> (приянто называть "origin")
# <ссылка-на-удаленный-репрозиторий> - соединение  лоакального репрозитория с удаленным
# git push <название_переменной>
#  <название-ветки> - отправка версии на github